{"keras_version": "2.2.4", "config": {"layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 8, 100], "dtype": "float32", "name": "input_3", "sparse": false}, "class_name": "InputLayer", "name": "input_3"}, {"inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"layers": [{"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_1", "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_2", "activation": "tanh", "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_3", "activation": "tanh", "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 32, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_4", "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 32, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_5", "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}], "name": "encoder"}, "class_name": "Sequential", "name": "encoder"}, {"inbound_nodes": [[["encoder", 1, 0, {}]]], "config": {"layers": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_6", "activation": "tanh", "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_7", "activation": "tanh", "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_8", "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 800, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_9", "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"target_shape": [8, 100], "trainable": true, "name": "reshape_1"}, "class_name": "Reshape"}], "name": "decoder"}, "class_name": "Sequential", "name": "decoder"}], "output_layers": [["decoder", 1, 0]], "name": "model_1", "input_layers": [["input_3", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}