{"config": {"name": "sequential_35", "layers": [{"config": {"padding": "same", "n_dft": 512, "norm": 1, "return_decibel_melgram": false, "sr": 16000, "dtype": "float32", "return_decibel_spectrogram": false, "trainable_fb": false, "n_hop": 256, "trainable": true, "image_data_format": "channels_last", "batch_input_shape": [null, 1, 80000], "fmax": 8000, "n_mels": 128, "power_spectrogram": 2.0, "name": "melspectrogram_35", "htk": false, "power_melgram": 1.0, "trainable_kernel": false, "fmin": 800}, "class_name": "Melspectrogram"}, {"config": {"padding": "valid", "kernel_regularizer": null, "name": "conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "filters": 32, "strides": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [9, 9]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "strides": [25, 17], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_35", "pool_size": [25, 17]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_35", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "units": 32, "trainable": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_171", "bias_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "units": 32, "trainable": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_172", "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_69", "rate": 0.2, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "units": 32, "trainable": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_173", "bias_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "units": 32, "trainable": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_174", "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_70", "rate": 0.2, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "units": 2, "trainable": true, "activation": "softmax", "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "name": "dense_175", "bias_constraint": null}, "class_name": "Dense"}]}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential"}