{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_6", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 100], "name": "input_6", "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"name": "encoder", "class_name": "Sequential", "config": {"name": "encoder", "layers": [{"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "units": 256, "name": "dense_10", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "units": 128, "name": "dense_11", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "units": 64, "name": "dense_12", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "units": 32, "name": "dense_13", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "units": 32, "name": "dense_14", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear"}}]}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "decoder", "class_name": "Sequential", "config": {"name": "decoder", "layers": [{"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "units": 64, "name": "dense_15", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "units": 128, "name": "dense_16", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "units": 256, "name": "dense_17", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "units": 800, "name": "dense_18", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear"}}, {"class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "target_shape": [8, 100]}}]}, "inbound_nodes": [[["encoder", 1, 0, {}]]]}], "input_layers": [["input_6", 0, 0]], "output_layers": [["decoder", 1, 0]]}, "backend": "tensorflow", "keras_version": "2.2.4"}